app/Models/Vehiculo.php

    public function getVehiculos() {
        return $this->where('baja', 'NO')->findAll();
---
SELECT *
FROM `vehiculos`
WHERE `baja` = 'NO'